1c-configuration-manager/src/Catalogs/СценарииОбработкиДанных/СценарииОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииОбработкиДанных</name>
  <attributes>
    <name>КонфигурацияБазовая</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияБазоваяНовая</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияИзмененная</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияИзмененнаяНовая</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогБазовая</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогБазоваяНовая</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИзмененная</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИзмененнаяНовая</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВременныеКаталоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьФайлы</name>
    <comment>Файлы имеющие совпадающие ключи игнорируются</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропускаемыеМетки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатываемыеМетки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьМетки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Сервера</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьФайлы</name>
    <comment>Загружаются только файлы совпадающие по ключам</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстанавливатьсяНаЭтапах</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершитьПослеЭтапа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьФайлыОтсутствующиеВБазовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

1c-configuration-manager/src/Catalogs/СценарииОбработкиДанных/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура КаталогБазоваяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Каталог = Объект.КаталогБазовая;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.КаталогБазовая = ДиалогВыбораФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогБазоваяНоваяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Каталог = Объект.КаталогБазоваяНовая;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.КаталогБазоваяНовая = ДиалогВыбораФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогИзмененнаяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Каталог = Объект.КаталогИзмененная;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.КаталогИзмененная = ДиалогВыбораФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогИзмененнаяНоваяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Каталог = Объект.КаталогИзмененнаяНовая;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.КаталогИзмененнаяНовая = ДиалогВыбораФайла.Каталог;
	КонецЕсли;
КонецПроцедуры


#Область Каталоги



#КонецОбласти
